---
kind: type
id: T:Autodesk.Revit.DB.FaceArrayIterator
source: html/3dd2435e-3b12-8d38-279a-e6141de1b390.htm
---
# Autodesk.Revit.DB.FaceArrayIterator

An iterator to a face array.

## Syntax (C#)
```csharp
public abstract class FaceArrayIterator : APIObject,
	IEnumerator
```